InformationRegisters/ЖурналРегистрацииСостоянийЗаявокНаОформлениеОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ЖурналРегистрацииСостоянийЗаявокНаОформлениеОпераций</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыЗаявок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>GUID_Меркурий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВремяПолученияЗаявкиСервисом</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВремяФормированияРезультата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВремяПолученияРезультатаВыполненияЗаявки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОшибкиВыполнения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДокументСсылка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриходныеОперации</v8:Type>
						<v8:Type>cfg:DocumentRef.ОбъединениеЗаписейСкладскогоЖурнала</v8:Type>
						<v8:Type>cfg:DocumentRef.ВнесениеСведенийОЛабораторныхИсследованиях</v8:Type>
						<v8:Type>cfg:DocumentRef.ПроизводственныеОперации</v8:Type>
						<v8:Type>cfg:DocumentRef.ВнесениеНомеровТранспортныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.Инвентаризации</v8:Type>
						<v8:Type>cfg:DocumentRef.ТранспортныеОперации</v8:Type>
						<v8:Type>cfg:DocumentRef.АннулированиеВСД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СвязиМеждуКонтрагентамиИПредприятиями.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>СвязиМеждуКонтрагентамиИПредприятиями</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>GLN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Предприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПараметрыАктуальныхОстатков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ПараметрыАктуальныхОстатков</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Предприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СмещениеВперед</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СмещениеНазад</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Продукция.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>Продукция</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ПодвидыПродукции</xr:Item>
			</Owners>
			<BasedOn>
				<xr:Item>Catalog.НоменклатураУчетнойСистемы</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>GTIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GUID_Меркурий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГОСТ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоУпаковок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПродукцияПолучателя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобственникТорговойМарки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Упаковки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДМ_КодSAP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>22</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДМ_Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокГодности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПроизводителиПродукции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Предприятие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СобственнаяПродукция</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Продукция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Продукция</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ОбщегоНазначенияУВСВызовСервера/Ext/Module.bsl
#Область СлужебныеПроцедурыИФункции

Функция ТекущийСтатусДокумента(ДокументСсылка) Экспорт 

	Возврат РегистрыСведений.ЖурналРегистрацииСостоянийЗаявокНаОформлениеОпераций.ТекущийСтатусДокумента(ДокументСсылка)	

КонецФункции

Функция ТекущийСтатусВСД(ДокументСсылка) Экспорт 

	Возврат РегистрыСведений.СтатусыВСД.ТекущийСтатусДокумента(ДокументСсылка)	

КонецФункции

Функция МассивСтатусовСЗапретомРедактированияФормы() Экспорт

	Возврат РегистрыСведений.ЖурналРегистрацииСостоянийЗаявокНаОформлениеОпераций.МассивСтатусовСЗапретомРедактированияФормы()

КонецФункции

Функция МассивИнформационныхСтатусов() Экспорт

	Возврат РегистрыСведений.ЖурналРегистрацииСостоянийЗаявокНаОформлениеОпераций.МассивИнформационныхСтатусов()	

КонецФункции

Функция МассивСтатусыОбработанныхЗаявок() Экспорт

	Возврат РегистрыСведений.ЖурналРегистрацииСостоянийЗаявокНаОформлениеОпераций.МассивСтатусыОбработанныхЗаявок()	

КонецФункции

Функция МассивСтатусовУспешноОбработано() Экспорт

	Возврат РегистрыСведений.ЖурналРегистрацииСостоянийЗаявокНаОформлениеОпераций.МассивСтатусовУспешноОбработано()	

КонецФункции

Функция МассивСтатусовВПроцессеОбработки() Экспорт

	Возврат РегистрыСведений.ЖурналРегистрацииСостоянийЗаявокНаОформлениеОпераций.МассивСтатусовВПроцессеОбработки()	

КонецФункции

Функция МассивСтатусовОшибок() Экспорт

	Возврат РегистрыСведений.ЖурналРегистрацииСостоянийЗаявокНаОформлениеОпераций.МассивСтатусовОшибок()	

КонецФункции

Функция ПоместитьТаблицуФормыВоВременноеХранилище(Знач Таблица, УникальныйИдентификаторФормы) Экспорт

	Возврат ПоместитьВоВременноеХранилище(Таблица.Выгрузить(), УникальныйИдентификаторФормы);

КонецФункции

Функция ПоместитьТаблицуУпаковокВоВременноеХранилище(Объект, ИдентификаторСтроки, ТабЧасть, УникальныйИдентификатор) Экспорт
	
	Если ЗначениеЗаполнено(ИдентификаторСтроки) Тогда
		ТаблицаУпаковок = Объект[ТабЧасть].Выгрузить(Новый Структура("GUIDСтроки", ИдентификаторСтроки));
	Иначе
		ТаблицаУпаковок = Объект[ТабЧасть].Выгрузить();
	КонецЕсли;
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаУпаковок, УникальныйИдентификатор);
	
КонецФункции

Функция КонтрагентыПоПредприятию(Предприятие, ТребуетсяСписокЗначений = Ложь, Текст = "", Основной = Ложь) Экспорт 

	Возврат РегистрыСведений.СвязиМеждуКонтрагентамиИПредприятиями.КонтрагентыПоПредприятию(Предприятие, ТребуетсяСписокЗначений, Текст, Основной)
	
КонецФункции

Функция ПредприятияПоКонтрагенту(Контрагент, ТребуетсяСписокЗначений = Ложь, Текст = "") Экспорт 

	Возврат РегистрыСведений.СвязиМеждуКонтрагентамиИПредприятиями.ПредприятияПоКонтрагенту(Контрагент, ТребуетсяСписокЗначений, Текст)

КонецФункции

Процедура ЗаполнитьДанныеПараметровОстатков() Экспорт
	Организация = ОрганизацияТекущегоПользователя();
	Контрагент  = КонтрагентПоОрганизации(Организация);
	СписокПредприятия = ПредприятияПоКонтрагенту(Контрагент);
	
	Для Каждого Предприятия Из СписокПредприятия Цикл
		Если Не Предприятия.НеИспользуется Тогда
			НовыеЗаписи = РегистрыСведений.ПараметрыАктуальныхОстатков.СоздатьНаборЗаписей();
			НовыеЗаписи.Отбор.Предприятие.Установить(Предприятия);
			НовыеЗаписи.Отбор.Контрагент.Установить(Контрагент);
			НовыеЗаписи.Отбор.Организация.Установить(Организация);
			НовыеЗаписи.Прочитать();
			Если Не НовыеЗаписи.Количество() > 0 Тогда
				НоваяЗапись = НовыеЗаписи.Добавить();
				НоваяЗапись.Контрагент = Контрагент;
				НоваяЗапись.Организация = Организация;
				НоваяЗапись.Предприятие = Предприятия;
				НоваяЗапись.СмещениеВперед = 600;
				НоваяЗапись.СмещениеНазад  = 3600;
				НовыеЗаписи.Записать();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция КонтрагентПредприятиеСвязаны(Контрагент, Предприятие) Экспорт

	Возврат РегистрыСведений.СвязиМеждуКонтрагентамиИПредприятиями.КонтрагентПредприятиеСвязаны(Контрагент, Предприятие);

КонецФункции // ()

Функция КонтрагентПоОрганизации(Организация) Экспорт 

	Возврат ОбщегоНазначенияУВССервер.КонтрагентПоОрганизации(Организация);
	
КонецФункции

Функция ПродукцияПредприятия(ПараметрыПодбора, Текст) Экспорт
	
	Возврат Справочники.Продукция.ПродукцияПредприятия(ПараметрыПодбора, Текст);
	
КонецФункции

Функция ПродукцияПолучателяПродукции(ПараметрыПодбора, Текст) Экспорт
	
	Возврат Справочники.Продукция.ПродукцияПолучателя(ПараметрыПодбора, Текст);
	
КонецФункции

Функция ОрганизацияТекущегоПользователя() Экспорт
	Возврат ОбщегоНазначенияУВССервер.ОрганизацияТекущегоПользователя();
КонецФункции

Функция ВидСервераВетисAPI() Экспорт 
	Возврат ОбщегоНазначенияУВССервер.ВидСервераВетисAPI();
КонецФункции

Функция НастройкаПодключенияКВетисAPI(Организация) Экспорт 

	Возврат ОбщегоНазначенияУВССервер.НастройкаПодключенияКВетисAPI(Организация);
	
КонецФункции

Функция ПолучитьПредприятияОбслуживаемыеТекущимПользователем(Организация, ТребуетсяСписокЗначений = Ложь, Текст = "") Экспорт
	
	Возврат ОбщегоНазначенияУВССервер.ПолучитьПредприятияОбслуживаемыеТекущимПользователем(Организация, ТребуетсяСписокЗначений, Текст);
	
КонецФункции

Функция ПолучитьСвойстваПродукции(Продукция) Экспорт
	
	Возврат ОбщегоНазначенияУВССервер.ПолучитьСвойстваПродукции(Продукция);
	
КонецФункции

#Область ОбработчикиСобытий_НоменклатураУчетнойСистемы

Функция НоменклатураУчетнойСистемыПоПродукции(ЗаписьСкладскогоЖурнала) Экспорт
	
	Возврат Справочники.НоменклатураУчетнойСистемы.НоменклатураУчетнойСистемыПоПродукции(ЗаписьСкладскогоЖурнала);
	
КонецФункции

Процедура НоменклатураУчетнойСистемыАвтоПодбор(ДанныеВыбора, Текст, ЗаписьСкладскогоЖурнала) Экспорт
	
	ДанныеВыбора = Справочники.НоменклатураУчетнойСистемы.НоменклатураУчетнойСистемыПоПродукции(ЗаписьСкладскогоЖурнала, Текст);
	
КонецПроцедуры

Процедура НоменклатураУчетнойСистемыОкончаниеВводаТекста(ДанныеВыбора, Текст, ЗаписьСкладскогоЖурнала) Экспорт
	
	ДанныеВыбора = Справочники.НоменклатураУчетнойСистемы.НоменклатураУчетнойСистемыПоПродукции(ЗаписьСкладскогоЖурнала, Текст);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
